app/views/records/index.html.slim

SELECT "practices".* FROM "practices" WHERE "practices"."record_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["record_id", 68], ["record_id", 72], ["record_id", 73], ["record_id", 74], ["record_id", 75], ["record_id", 76], ["record_id", 77], ["record_id", 78]]
SELECT SUM("practices"."practice_time") FROM "practices" WHERE "practices"."record_id" = $1  [["record_id", 68]]
---
            td= record.created_at.strftime("%Y-%m-%d%H:%M")
            td= record.practices.sum(:practice_time)