app/controllers/records_controller.rb

  def index
    @q = current_user.records.ransack(params[:q])
    @search_records = @q.result(distinct: true).includes(:practices).page(params[:page]).per(8)
---
SELECT  DISTINCT "records".* FROM "records" WHERE "records"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", "3"], ["LIMIT", 8], ["OFFSET", 0]]
SELECT "practices".* FROM "practices" WHERE "practices"."record_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["record_id", 68], ["record_id", 72], ["record_id", 73], ["record_id", 74], ["record_id", 75], ["record_id", 76], ["record_id", 77], ["record_id", 78]]
SELECT COUNT(DISTINCT "records"."id") FROM "records" WHERE "records"."user_id" = $1  [["user_id", "3"]]

  def aggregate_result
  @record = current_user.records.includes(:practices).select(:practice_time).group(:practice_item).sum(:practice_time)
---
SELECT SUM(practice_time) AS sum_practice_time, "practice_item" AS practice_item FROM "records" LEFT OUTER JOIN "practices" ON "practices"."record_id" = "records"."id" WHERE "records"."user_id" = $1 GROUP BY "practice_item"  [["user_id", "3"]]